keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEth_regdef.h
/** \\brief  Register 133 - Receive IPV4 Header Error Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits
{
    unsigned int RXIPV4HDRERRFRM:32;        /**< \brief [31:0] RXIPV4HDRERRFRM (r) */
} Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits;

/** \\brief  Register 149 - Receive IPV4 Header Error Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits
{
    unsigned int RXIPV4HDRERROCT:32;        /**< \brief [31:0] This field indicates the number of bytes received in the IPv4 datagrams with header errors (checksum, length, or version mismatch). The value in the Length field of IPv4 header is used to update this counter. (r) */
} Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits;

/** \\brief  Register 134 - Receive IPV4 No Payload Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits
{
    unsigned int RXIPV4NOPAYFRM:32;         /**< \brief [31:0] RXIPV4NOPAYFRM (r) */
} Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits;

/** \\brief  Register 150 - Receive IPV4 No Payload Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits
{
    unsigned int RXIPV4NOPAYOCT:32;         /**< \brief [31:0] This field indicates the number of bytes received in IPv4 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv4 headers Length field is used to update this counter. (r) */
} Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits;

/** \\brief  Register 152 - Receive IPV4 Fragmented Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits
{
    unsigned int RXIPV4UDSBLOCT:32;         /**< \brief [31:0] RXIPV4UDSBLOCT (r) */
} Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits;

/** \\brief  Register 136 - Receive IPV4 UDP Checksum Disabled Frame Counter
 * Register */
typedef struct _Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits
{
    unsigned int RXIPV4UDSBLFRM:32;         /**< \brief [31:0] RXIPV4UDSBLFRM (r) */
} Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits;

/** \\brief  Register 137 - Receive IPV6 Good Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits
{
    unsigned int RXIPV6GDFRM:32;            /**< \brief [31:0] RXIPV6GDFRM (r) */
} Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits;

/** \\brief  Register 153 - Receive IPV6 Good Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits
{
    unsigned int RXIPV6GDOCT:32;            /**< \brief [31:0] Thsi field indicates the number of bytes received in good IPv6 datagrams encapsulating TCP, UDP or ICMPv6 data. (r) */
} Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits;

/** \\brief  Register 138 - Receive IPV6 Header Error Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits
{
    unsigned int RXIPV6HDRERRFRM:32;        /**< \brief [31:0] RXIPV6HDRERRFRM (r) */
} Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits;

/** \\brief  Register 154 - Receive IPV6 Header Error Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits
{
    unsigned int RXIPV6HDRERROCT:32;        /**< \brief [31:0] This field indicates the number of bytes received in IPv6 datagrams with header errors (length or version mismatch). The value in the IPv6 headers Length field is used to update this counter. (r) */
} Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits;

/** \\brief  Register 139 - Receive IPV6 No Payload Frame Counter Register */
typedef struct _Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits
{
    unsigned int RXIPV6NOPAYFRM:32;         /**< \brief [31:0] RXIPV6NOPAYFRM (r) */
} Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits;

/** \\brief  Register 155 - Receive IPV6 No Payload Octet Counter Register */
typedef struct _Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits
{
    unsigned int RXIPV6NOPAYOCT:32;         /**< \brief [31:0] This field indicates the number of bytes received in IPv6 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv6 headers Length field is used to update this counter. (r) */
} Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits;

/** \\brief  Register 143 - Receive TCP Error Frame Counter Register */
typedef struct _Ifx_ETH_RXTCP_ERROR_FRAMES_Bits
{
    unsigned int RXTCPERRFRM:32;            /**< \brief [31:0] RXTCPERRFRM (r) */
} Ifx_ETH_RXTCP_ERROR_FRAMES_Bits;

/** \\brief  Register 159 - Receive TCP Error Octet Counter Register */
typedef struct _Ifx_ETH_RXTCP_ERROR_OCTETS_Bits
{
    unsigned int RXTCPERROCT:32;            /**< \brief [31:0] RXTCPERROCT (r) */
} Ifx_ETH_RXTCP_ERROR_OCTETS_Bits;

/** \\brief  Register 142 - Receive TCP Good Frame Counter Register */
typedef struct _Ifx_ETH_RXTCP_GOOD_FRAMES_Bits
{
    unsigned int RXTCPGDFRM:32;             /**< \brief [31:0] RXTCPGDFRM (r) */
} Ifx_ETH_RXTCP_GOOD_FRAMES_Bits;

/** \\brief  Register 158 - Receive TCP Good Octet Counter Register */
typedef struct _Ifx_ETH_RXTCP_GOOD_OCTETS_Bits
{
    unsigned int RXTCPGDOCT:32;             /**< \brief [31:0] RXTCPGDOCT (r) */
} Ifx_ETH_RXTCP_GOOD_OCTETS_Bits;

/** \\brief  Register 141 - Receive UDP Error Frame Counter Register */
typedef struct _Ifx_ETH_RXUDP_ERROR_FRAMES_Bits
{
    unsigned int RXUDPERRFRM:32;            /**< \brief [31:0] RXUDPERRFRM (r) */
} Ifx_ETH_RXUDP_ERROR_FRAMES_Bits;

/** \\brief  Register 157 - Receive UDP Error Octet Counter Register */
typedef struct _Ifx_ETH_RXUDP_ERROR_OCTETS_Bits
{
    unsigned int RXUDPERROCT:32;            /**< \brief [31:0] RXUDPERROCT (r) */
} Ifx_ETH_RXUDP_ERROR_OCTETS_Bits;

/** \\brief  Register 140 - Receive UDP Good Frame Counter Register */
typedef struct _Ifx_ETH_RXUDP_GOOD_FRAMES_Bits
{
    unsigned int RXUDPGDFRM:32;             /**< \brief [31:0] RXUDPGDFRM (r) */
} Ifx_ETH_RXUDP_GOOD_FRAMES_Bits;

/** \\brief  Register 156 - Receive UDP Good Octet Counter Register */
typedef struct _Ifx_ETH_RXUDP_GOOD_OCTETS_Bits
{
    unsigned int RXUDPGDOCT:32;             /**< \brief [31:0] RXUDPGDOCT (r) */
} Ifx_ETH_RXUDP_GOOD_OCTETS_Bits;

